; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	thermograph4 - mode
	infrared5 - mode
	spectrograph7 - mode
	image1 - mode
	thermograph2 - mode
	spectrograph3 - mode
	image6 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	Star6 - direction
	GroundStation1 - direction
	Star4 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image6)
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph7)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(supports instrument1 infrared5)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Star7 thermograph4)
	(have_image Star7 image1)
	(have_image Phenomenon8 spectrograph3)
	(have_image Phenomenon8 image6)
	(have_image Star9 infrared0)
	(have_image Star10 spectrograph3)
	(have_image Star10 image1)
	(have_image Planet11 infrared0)
	(have_image Planet11 thermograph4)
))

)

; plan
1. (turn_to satellite0 star4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star4)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 star9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star9)
   goals met: 0 of 10
5. (take_image satellite0 star9 instrument1 infrared0)
   added: (have_image star9 infrared0)
   goals met: 1 of 10
6. (turn_to satellite0 star7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star7)
   goals met: 1 of 10
7. (take_image satellite0 star7 instrument1 image1)
   added: (have_image star7 image1)
   goals met: 2 of 10
8. (turn_to satellite0 star10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star10)
   goals met: 2 of 10
9. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 3 of 10
10. (turn_to satellite0 planet11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet11)
   goals met: 3 of 10
11. (take_image satellite0 planet11 instrument1 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 4 of 10
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 10
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 10
14. (turn_to satellite0 groundstation1 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 10
15. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 4 of 10
16. (turn_to satellite0 phenomenon8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 10
17. (take_image satellite0 phenomenon8 instrument0 image6)
   added: (have_image phenomenon8 image6)
   goals met: 5 of 10
18. (take_image satellite0 phenomenon8 instrument0 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 6 of 10
19. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 6 of 10
20. (take_image satellite0 planet11 instrument0 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 7 of 10
21. (turn_to satellite0 star10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star10)
   goals met: 7 of 10
22. (take_image satellite0 star10 instrument0 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 8 of 10
23. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 8 of 10
24. (take_image satellite0 star7 instrument0 thermograph4)
   added: (have_image star7 thermograph4)
   goals met: 9 of 10
25. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 10 of 10
